""" Лабораторная работа №2 """
# print("\n=== ЗАДАНИЕ 2.1 -> 1 ===")
# a = int(input("a="))
# b = int(input("b="))
# if a > b:
#     print("a>b")
# elif a == b:
#     print("a==b")
# else :
#     print("a<b")

# print("\n=== ЗАДАНИЕ 2.1 -> 2 ===")

# price_per_liter = float(input("Введите цену за литр топлива: "))
# liters = float(input("Введите количество литров: "))
#
# total = price_per_liter * liters
#
# if liters > 10:
#     total *= 0.97
# print("Стоимость заправки:", round(total, 2))

print("\n=== ЗАДАНИЕ 2.1 -> 3 ===")

# Напишите программу-игру. Компьютер загадывает
# число, пользователь пытается его угадать.
# Если число угадано, то выводим на экран «Победа», иначе – «Повторите еще раз».
import random

# import random
# computer = random.randint(1, 10)
# user = int(input("enter number: "))
# if computer == user:
#     print("True")
# else:
#     print("Wrong computer:", computer)

print("\n=== ЗАДАНИЕ 2.2 ===")
# # Написать программу проверки знания даты день города Бишкек.
# # В случае неправильного ответа пользователя, программа должна выводить правильную дату.
# year =  "29 апреля 1878 год"
# enter = input("enter year: ")
# if enter == year:
#     print("True" )
# else:
#     print("Wrong" , year)



